In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

In [3]:
dframe = DataFrame({'k1': ['X','X','Y','Y','Z'],
                   'k2': ['alpha', 'beta',' alpha', 'beta', 'alpha'],
                   'dataset1': np.random.randn(5),
                   'dataset2': np.random.randn(5)})

In [4]:
dframe

   dataset1  dataset2 k1      k2
0  0.149585  0.206983  X   alpha
1 -1.444414 -0.670377  X    beta
2  0.022904  0.228428  Y   alpha
3  1.085872  0.743261  Y    beta
4  0.376016  1.048677  Z   alpha

In [5]:
group1 = dframe['dataset1'].groupby(dframe['k1'])

In [6]:
group1

In [7]:
group1.mean()

k1
X   -0.647414
Y    0.554388
Z    0.376016
Name: dataset1, dtype: float64

In [8]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN', 'FEB', 'JAN', 'FEB', 'JAN'])

In [9]:
dframe

   dataset1  dataset2 k1      k2
0  0.149585  0.206983  X   alpha
1 -1.444414 -0.670377  X    beta
2  0.022904  0.228428  Y   alpha
3  1.085872  0.743261  Y    beta
4  0.376016  1.048677  Z   alpha

In [12]:
dframe['dataset1'].groupby([cities, month]).mean()

LA  FEB   -1.444414
    JAN    0.022904
NY  FEB    1.085872
    JAN    0.262801
Name: dataset1, dtype: float64

In [13]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.647414 -0.231697
Y   0.554388  0.485845
Z   0.376016  1.048677

In [14]:
dframe.groupby(['k1', 'k2']).mean()

           dataset1  dataset2
k1 k2
X  alpha   0.149585  0.206983
   beta   -1.444414 -0.670377
Y   alpha  0.022904  0.228428
   beta    1.085872  0.743261
Z  alpha   0.376016  1.048677

In [15]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]

In [16]:
dataset2_group.mean()

           dataset2
k1 k2
X  alpha   0.206983
   beta   -0.670377
Y   alpha  0.228428
   beta    0.743261
Z  alpha   1.048677

In [17]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [18]:
for name, group in dframe.groupby('k1'):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the X group
   dataset1  dataset2 k1     k2
0  0.149585  0.206983  X  alpha
1 -1.444414 -0.670377  X   beta


This is the Y group
   dataset1  dataset2 k1      k2
2  0.022904  0.228428  Y   alpha
3  1.085872  0.743261  Y    beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.376016  1.048677  Z  alpha

In [19]:
for name, group in dframe.groupby(['k1', 'k2']):
    print('This is the {} group'.format(name))
    print(group)
    print('\n')

This is the ('X', 'alpha') group
   dataset1  dataset2 k1     k2
0  0.149585  0.206983  X  alpha


This is the ('X', 'beta') group
   dataset1  dataset2 k1    k2
1 -1.444414 -0.670377  X  beta


This is the ('Y', ' alpha') group
   dataset1  dataset2 k1      k2
2  0.022904  0.228428  Y   alpha


This is the ('Y', 'beta') group
   dataset1  dataset2 k1    k2
3  1.085872  0.743261  Y  beta


This is the ('Z', 'alpha') group
   dataset1  dataset2 k1     k2
4  0.376016  1.048677  Z  alpha

In [20]:
for (k1,k2), group in dframe.groupby(['k1', 'k2']):
    print('Key1={}, Key2={}'.format(k1,k2))
    print(group)
    print('\n')

Key1=X, Key2=alpha
   dataset1  dataset2 k1     k2
0  0.149585  0.206983  X  alpha


Key1=X, Key2=beta
   dataset1  dataset2 k1    k2
1 -1.444414 -0.670377  X  beta


Key1=Y, Key2= alpha
   dataset1  dataset2 k1      k2
2  0.022904  0.228428  Y   alpha


Key1=Y, Key2=beta
   dataset1  dataset2 k1    k2
3  1.085872  0.743261  Y  beta


Key1=Z, Key2=alpha
   dataset1  dataset2 k1     k2
4  0.376016  1.048677  Z  alpha

In [21]:
gr = dframe.groupby('k1')

In [22]:
gr

In [23]:
gr.get_group('X')

   dataset1  dataset2 k1     k2
0  0.149585  0.206983  X  alpha
1 -1.444414 -0.670377  X   beta

In [24]:
group_dict = dict(list(dframe.groupby('k1')))

In [26]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.149585  0.206983  X  alpha
1 -1.444414 -0.670377  X   beta

In [28]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [29]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.149585  0.206983
 1 -1.444414 -0.670377
 2  0.022904  0.228428
 3  1.085872  0.743261
 4  0.376016  1.048677, dtype('O'):   k1      k2
 0  X   alpha
 1  X    beta
 2  Y   alpha
 3  Y    beta
 4  Z   alpha}